Repository: glebgalkin/recommendo
Catalog: frontend/mobile/lib/l10n/arb/app_*.arb
Languages: ru

# invalidSearchMsg
source: Invalid search. City is required
ru: Город обязателен

# emptyRecommendationList
source: No recommendations
ru: Нет рекоммендаций по заданному поиску

# failedFetchingRecommendationsMsg
source: Failed to fetch
ru: Ошибка получения

# creationPageAppBarTitle
source: Create recommendation
ru: Создание рекоммендации

# backButtonLabel
source: Back
ru: Назад

# continueButtonLabel
source: Continue
ru: Продолжить

# submitButtonLabel
source: Submit
ru: Отправить

# generalInfoHelperText
source: Please provide basic info
ru: Пожалуйста, укажите базовую информацию

# searchCityLabel
source: City
ru: Город

# searchCityErrorMsg
source: City is required
ru: Город обязателен

# recommendationTitleLabel
source: Title
ru: Название

# recommendationTitleErrorMsg
source: Title can't be empty
ru: Название обязательно

# recommendationDescriptionLabel
source: Description
ru: Описание

# socialLinkHelperText
source: Please provide instagram info
ru: Пожалуйста, укажите ссылку на инстаграмм

# confirmationHelperText
source: Make sure info you entered is correct
ru: Удостоверьтесь в правильности введеной информации
